Linux4/samsung_kernel/kernel/kernel_device_modules-6.1/drivers/input/sec_input/stm32/stm32_pogo_cmd_v3.c
#include "stm32_pogo_v3.h"

static void stm32_get_tc_fw_info_of_bin(struct stm32_dev *stm32)
{
	if (!stm32->tc_fw)
		return;

	stm32->tc_fw_ver_of_bin.data_ver = (u16)(stm32->tc_fw->data[52] | (stm32->tc_fw->data[53] << 8));
	stm32->tc_fw_ver_of_bin.major_ver = (u16)(stm32->tc_fw->data[56] | (stm32->tc_fw->data[57] << 8));
	stm32->tc_fw_ver_of_bin.minor_ver = (u16)(stm32->tc_fw->data[60] | (stm32->tc_fw->data[61] << 8));

	input_info(true, &stm32->client->dev, "%s: [TC BIN] version:0x%02X%02X, data_ver:0x%X\n",
			__func__, stm32->tc_fw_ver_of_bin.major_ver, stm32->tc_fw_ver_of_bin.minor_ver,
			stm32->tc_fw_ver_of_bin.data_ver);
}

static void stm32_get_fw_info_of_bin(struct stm32_dev *stm32)
{
	int magic_offset = (stm32->keyboard_model < STM32_FW_OFFSET_MODEL_DEFINE_VALUE) ?
		STM32_FW_APP_CFG_OFFSET_L0 : STM32_FW_APP_CFG_OFFSET_G0;

	if (!stm32->fw)
		return;

	memcpy(stm32->fw_header, &stm32->fw->data[magic_offset], sizeof(struct stm32_fw_header));
	stm32->crc_of_bin = stm32_crc32((u8 *)stm32->fw->data, stm32->fw->size);

	input_info(true, &stm32->client->dev, "%s: [BIN] %s, version:%d.%d, model_id:%d, hw_rev:%d, CRC:0x%X magic_offset:0x%x\n",
			__func__, stm32->fw_header->magic_word, stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver, stm32->fw_header->boot_app_ver.model_id,
			stm32->fw_header->boot_app_ver.hw_rev, stm32->crc_of_bin, magic_offset);
}

static int stm32_load_fw_from_fota(struct stm32_dev *stm32, enum stm32_ed_id ed_id)
{
	struct firmware *fw;

	if (ed_id == ID_MCU) {
		fw = stm32->fw;
	} else if (ed_id == ID_TOUCHPAD) {
		fw = stm32->tc_fw;
	} else {
		input_err(true, &stm32->client->dev, "%s: wrong ed_id %d\n", __func__, ed_id);
		return -EINVAL;
	}

	mutex_lock(&stm32->fw_lock);
	if (stm32->sec_pogo_keyboard_size > STM32_FW_SIZE) {
		input_err(true, &stm32->client->dev, "%s overflow error totalsize:%ld\n",
				__func__, stm32->sec_pogo_keyboard_size);
		stm32->sec_pogo_keyboard_size = 0;
		mutex_unlock(&stm32->fw_lock);
		return -EINVAL;
	}

	memcpy((void *)fw->data, (void *)stm32->sec_pogo_keyboard_fw, stm32->sec_pogo_keyboard_size);
	fw->size = stm32->sec_pogo_keyboard_size;
	mutex_unlock(&stm32->fw_lock);

	if (ed_id == ID_MCU)
		stm32_get_fw_info_of_bin(stm32);
	else if (ed_id == ID_TOUCHPAD)
		stm32_get_tc_fw_info_of_bin(stm32);

	return 0;
}

static bool stm32_check_fw_update(struct stm32_dev *stm32)
{
	u16 fw_ver_bin, fw_ver_ic;

	if (stm32_read_version(stm32) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read version\n", __func__);
		return false;
	}

	if (stm32_read_crc(stm32) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read crc\n", __func__);
		return false;
	}

	if (stm32_load_fw_from_fota(stm32, ID_MCU) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return false;
	}

	fw_ver_bin = stm32->fw_header->boot_app_ver.fw_major_ver << 8 | stm32->fw_header->boot_app_ver.fw_minor_ver;
	fw_ver_ic = stm32->ic_fw_ver.fw_major_ver << 8 | stm32->ic_fw_ver.fw_minor_ver;

	input_info(true, &stm32->client->dev, "%s: [BIN] V:%d.%d CRC:0x%X / [IC] V:%d.%d CRC:0x%X\n",
			__func__, stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver,
			stm32->crc_of_bin, stm32->ic_fw_ver.fw_major_ver,
			stm32->ic_fw_ver.fw_minor_ver, stm32->crc_of_ic);

	if (strncmp(STM32_MAGIC_WORD, stm32->fw_header->magic_word, 5) != 0) {
		input_info(true, &stm32->client->dev, "%s: binary file is wrong : %s\n",
				__func__, stm32->fw_header->magic_word);
		return false;
	}

	if (0) { //stm32->fw_header->boot_app_ver.model_id != stm32->ic_fw_ver.model_id) {
		input_info(true, &stm32->client->dev, "%s: [BIN] %d / [IC] %d : different model id. do not update\n",
				__func__, stm32->fw_header->boot_app_ver.model_id, stm32->ic_fw_ver.model_id);
		return false;
	}

	if (fw_ver_bin > fw_ver_ic) {
		input_info(true, &stm32->client->dev, "%s: need to update fw\n", __func__);
		return true;
	} else if (fw_ver_bin == fw_ver_ic && stm32->crc_of_bin != stm32->crc_of_ic) {
		input_err(true, &stm32->client->dev, "%s: CRC mismatch! need to update fw\n", __func__);
		return true;
	}

	input_info(true, &stm32->client->dev, "%s: skip fw update\n", __func__);
	return false;
}

static ssize_t keyboard_connected_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t size)
{
	struct stm32_dev *data = dev_get_drvdata(dev);
	int onoff, err;

	if (strlen(buf) > 2) {
		input_err(true, &data->client->dev, "%s: cmd length is over %d\n", __func__, (int)strlen(buf));
		return -EINVAL;
	}

	err = kstrtoint(buf, 10, &onoff);
	if (err)
		return err;

	if (data->connect_state == !!onoff)
		return size;

	data->connect_state = !!onoff;
	input_info(true, &data->client->dev, "%s: current %d\n", __func__, data->connect_state);
	stm32_keyboard_connect(data);

	return size;
}

static ssize_t keyboard_connected_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *data = dev_get_drvdata(dev);

	input_info(true, dev, "%s: %d\n", __func__, data->connect_state);

	return snprintf(buf, 5, "%d\n", data->connect_state);
}

static ssize_t hw_reset_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *data = dev_get_drvdata(dev);

	input_info(true, dev, "%s\n", __func__);
	gpio_direction_output(data->dtdata->mcu_nrst, 0);
	stm32_delay(3);
	gpio_direction_output(data->dtdata->mcu_nrst, 1);

	return snprintf(buf, 5, "%d\n", data->dtdata->mcu_nrst);
}

static ssize_t get_fw_ver_ic_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

	snprintf(buff, sizeof(buff), "%s_v%d.%d.%d.%d",
			stm32->model_name,
			stm32->ic_fw_ver.fw_major_ver,
			stm32->ic_fw_ver.fw_minor_ver,
			stm32->ic_fw_ver.model_id,
			stm32->ic_fw_ver.hw_rev);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t get_fw_ver_bin_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

