Linux4/samsung_kernel/kernel/kernel_device_modules-6.1/drivers/input/sec_input/stm32/stm32_pogo_cmd_v3.c
	if (stm32_load_fw_from_fota(stm32, ID_MCU) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return snprintf(buf, sizeof(buff), "NG");
	}

	snprintf(buff, sizeof(buff), "%s_v%d.%d.%d.%d",
			stm32->model_name,
			stm32->fw_header->boot_app_ver.fw_major_ver,
			stm32->fw_header->boot_app_ver.fw_minor_ver,
			stm32->fw_header->boot_app_ver.model_id,
			stm32->fw_header->boot_app_ver.hw_rev);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t get_crc_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

	snprintf(buff, sizeof(buff), "%08X", stm32->crc_of_ic);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t check_fw_update_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);

	if (stm32_check_fw_update(stm32))
		return snprintf(buf, 3, "OK");
	else
		return snprintf(buf, 3, "NG");
}

static int stm32_write_fw(struct stm32_dev *stm32, enum stm32_ed_id ed_id, u16 page_size)
{
	const struct firmware *fw;
	int page_num, page_index = 0, ret, retry = 3, last_page_size;
	u8 buff[3] = { 0 };

	if (ed_id == ID_MCU) {
		fw = stm32->fw;
	} else if (ed_id == ID_TOUCHPAD) {
		fw = stm32->tc_fw;
	} else {
		input_err(true, &stm32->client->dev, "%s: wrong ed_id %d\n", __func__, ed_id);
		return -EINVAL;
	}

	if (!fw) {
		input_err(true, &stm32->client->dev, "%s: fw is null\n", __func__);
		return -ENOENT;
	}

	page_num = fw->size / page_size;
	last_page_size = fw->size % page_size;

	if (last_page_size == 0) {
		page_num--;
		last_page_size = page_size;
	}

	input_info(true, &stm32->client->dev,
			"%s: fw size: %ld, page size: %d, page num: %d, last page size: %d, packet size: %d\n",
			__func__, fw->size, page_size, page_num, last_page_size, STM32_CFG_PACKET_SIZE);

	while (page_index <= page_num) {
		u8 *pn_data = (u8 *)&fw->data[page_index * page_size];
		u8 send_data[STM32_CFG_PACKET_SIZE + 5] = { 0 };
		u32 page_crc;
		u16 page_index_cmp;
		int delayms = 20; /* test */

		if (ed_id == ID_TOUCHPAD && page_index == page_num) {
			send_data[0] = STM32_CMD_WRITE_LAST_PAGE;
			page_size = last_page_size;
			delayms = 500;
		} else {
			send_data[0] = STM32_CMD_WRITE_PAGE;
		}

		memcpy(&send_data[1], pn_data, page_size);
		page_crc = stm32_crc32(pn_data, page_size);
		memcpy(&send_data[page_size + 1], &page_crc, 4);

		input_dbg(false, &stm32->client->dev, "%s: write page %d, size %d, CRC 0x%08X\n",
				__func__, page_index, page_size, page_crc);

		ret = stm32_i2c_header_write(stm32->client, ed_id, page_size + 5);
		if (ret < 0)
			return ret;

		ret = stm32_i2c_write_burst(stm32->client, send_data, page_size + 5);
		if (ret < 0)
			return ret;

		stm32_delay(delayms);

		/* read page index */
		ret = stm32_i2c_read_bulk(stm32->client, buff, 3);
		if (ret < 0)
			return ret;
		ret = stm32_i2c_read_bulk(stm32->client, buff, 2);
		if (ret < 0)
			return ret;
		memcpy(&page_index_cmp, buff, 2);
		page_index++;

		if (page_index == page_index_cmp) {
			retry = 3;
		} else {
			page_index--;
			input_err(true, &stm32->client->dev, "%s: page %d(%d) is not programmed, retry %d\n",
					__func__, page_index, page_index_cmp, 3 - retry);
			retry--;
		}

		if (retry < 0) {
			input_err(true, &stm32->client->dev, "%s: failed\n", __func__);
			return -EIO;
		}
	}

	input_info(true, &stm32->client->dev, "%s: done\n", __func__);
	return 0;
}

static int stm32_fw_update(struct stm32_dev *stm32)
{
	int ret;
	u8 buff[4] = { 0 };
	u16 page_size;
	struct stm32_fw_version target_fw;
	u32 target_crc;

	if (!stm32->fw)
		return -ENOENT;

	if (strncmp(STM32_MAGIC_WORD, stm32->fw_header->magic_word, 5) != 0) {
		input_info(true, &stm32->client->dev, "%s: firmware file is wrong : %s\n",
				__func__, stm32->fw_header->magic_word);
		mutex_lock(&stm32->fw_lock);
		memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
		stm32->sec_pogo_keyboard_size = 0;
		mutex_unlock(&stm32->fw_lock);
		return -ENOENT;
	}

	ret = stm32_set_mode(stm32, MODE_DFU);
	if (ret < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to set DFU mode\n", __func__);
		mutex_lock(&stm32->fw_lock);
		memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
		stm32->sec_pogo_keyboard_size = 0;
		mutex_unlock(&stm32->fw_lock);
		return ret;
	}

	stm32_enable_irq(stm32, INT_DISABLE_SYNC);

	stm32_delay(1000);

	ret = stm32_read_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_GET_PROTOCOL_VERSION, 2, buff);
	if (ret < 0)
		goto out;
	input_info(true, &stm32->client->dev, "%s: protocol ver: 0x%02X%02X\n", __func__, buff[1], buff[0]);

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_GET_PAGE_SIZE, 2, buff);
	if (ret < 0)
		goto out;

	memcpy(&page_size, &buff[0], 2);

	/* disable write protection of target bank & erase the target bank */
	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_START_FW_UPGRADE, 1, buff);
	if (ret < 0 || buff[0] == 0xFF)
		goto out;
	input_info(true, &stm32->client->dev, "%s: bank %02X is erased\n", __func__, buff[0]);

	mutex_lock(&stm32->i2c_lock);
	ret = stm32_write_fw(stm32, ID_MCU, page_size);
	mutex_unlock(&stm32->i2c_lock);
	if (ret < 0)
		goto out;

	/* check fw version & crc of target bank */
	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_GET_TARGET_FW_VERSION, 4, buff);
	if (ret < 0)
		goto out;

	target_fw.hw_rev = buff[0];
	target_fw.model_id = buff[1];
	target_fw.fw_minor_ver = buff[2];
	target_fw.fw_major_ver = buff[3];

	input_info(true, &stm32->client->dev, "%s: [TARGET] version:%d.%d, model_id:%d\n",
			__func__, target_fw.fw_major_ver, target_fw.fw_minor_ver, target_fw.model_id);

	if (target_fw.fw_major_ver != stm32->fw_header->boot_app_ver.fw_major_ver ||
		target_fw.fw_minor_ver != stm32->fw_header->boot_app_ver.fw_minor_ver) {
		input_err(true, &stm32->client->dev, "%s: version mismatch!\n", __func__);
		goto out;
	}

