Linux4/samsung_kernel/kernel/kernel_device_modules-6.1/drivers/input/sec_input/stm32/stm32_pogo_cmd_v3.c
	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, STM32_CMD_GET_TARGET_FW_CRC32, 4, buff);
	if (ret < 0)
		goto out;

	target_crc = buff[3] << 24 | buff[2] << 16 | buff[1] << 8 | buff[0];

	input_info(true, &stm32->client->dev, "%s: [TARGET] CRC:0x%08X\n", __func__, target_crc);
	if (target_crc != stm32->crc_of_bin) {
		input_err(true, &stm32->client->dev, "%s: CRC mismatch!\n", __func__);
		goto out;
	}

	/* leave the DFU mode with switching to target bank */
	ret = stm32_i2c_reg_write(stm32->client, ID_MCU, STM32_CMD_GO);
	if (ret < 0)
		goto out;

	input_info(true, &stm32->client->dev, "%s: [APP MODE] Start with target bank\n", __func__);

	if (stm32->connect_state)
		stm32_enable_irq(stm32, INT_ENABLE);

	mutex_lock(&stm32->fw_lock);
	memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
	stm32->sec_pogo_keyboard_size = 0;
	mutex_unlock(&stm32->fw_lock);

	return 0;

out:
	mutex_lock(&stm32->fw_lock);
	memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
	stm32->sec_pogo_keyboard_size = 0;
	mutex_unlock(&stm32->fw_lock);

	stm32_delay(1000);

	/* leave the DFU mode without switching to target bank */
	ret = stm32_i2c_reg_write(stm32->client, ID_MCU, STM32_CMD_ABORT);
	if (ret < 0)
		return ret;

	input_info(true, &stm32->client->dev, "%s: [APP MODE] Start with boot bank\n", __func__);

	if (stm32->connect_state)
		stm32_enable_irq(stm32, INT_ENABLE);

	return -EIO;
}

static ssize_t debug_level_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, level;

	ret = kstrtoint(buf, 10, &level);
	if (ret)
		return ret;

	stm32->debug_level = level;

	input_info(true, &stm32->client->dev, "%s: %d\n", __func__, stm32->debug_level);
	return size;
}

static ssize_t debug_level_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);

	input_info(true, &stm32->client->dev, "%s: %d\n", __func__, stm32->debug_level);

	return snprintf(buf, 5, "%d\n", stm32->debug_level);
}

#if !IS_ENABLED(CONFIG_SAMSUNG_PRODUCT_SHIP)
static ssize_t write_cmd_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, reg;

	ret = kstrtoint(buf, 0, &reg);
	if (ret)
		return ret;

	if (reg > 0xFF)
		return -EIO;

	ret = stm32_i2c_reg_write(stm32->client, ID_MCU, reg);

	input_info(true, &stm32->client->dev, "%s: write 0x%02X, ret: %d\n", __func__, reg, ret);
	return size;
}

static ssize_t read_cmd_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, reg;
	u8 buff[256] = { 0 };

	ret = kstrtoint(buf, 0, &reg);
	if (ret)
		return ret;

	if (reg > 0xFF)
		return -EIO;

	ret = stm32_i2c_reg_read(stm32->client, ID_MCU, reg, 255, buff);

	input_info(true, &stm32->client->dev, "%s: read 0x%02X, ret: %d\n", __func__, reg, ret);
	return size;
}

static ssize_t set_booster_voltage_store(struct device *dev, struct device_attribute *attr,
		const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, voltage;

	ret = kstrtoint(buf, 0, &voltage);
	if (ret) {
		input_err(true, &stm32->client->dev, "%s: error parm(%s)\n", __func__, buf);
		return size;
	}

	if (voltage == 0 || voltage == 1) {
		ret = stm32_dev_regulator(stm32, voltage);
		if (ret < 0) {
			input_err(true, &stm32->client->dev, "%s: regulator %s error\n",
				__func__, voltage ? "ON" : "OFF");
		}
		stm32_delay(100);

	} else if (voltage >= 260000 && voltage <= 514000) {
		/* for test */
		if (!regulator_is_enabled(stm32->dtdata->vdd_vreg)) {
			input_err(true, &stm32->client->dev, "%s: not enable en pin\n", __func__);
			return size;
		}

		ret = kbd_max77816_control(stm32, voltage);
		if (ret < 0)
			input_err(true, &stm32->client->dev, "%s: control fail(%d)\n", __func__, voltage);
	} else {
		input_err(true, &stm32->client->dev, "%s: out of range voltage:%d\n", __func__, voltage);
		return size;
	}

	input_info(true, &stm32->client->dev, "%s: voltage:%d, ret: %d\n", __func__, voltage, ret);
	return size;
}
#endif

static ssize_t get_tc_fw_ver_bin_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32_load_fw_from_fota(stm32, ID_TOUCHPAD) < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to read bin data\n", __func__);
		return snprintf(buf, sizeof(buff), "NG");
	}

	snprintf(buff, sizeof(buff), "%s-TC_v%02X%02X",
			stm32->model_name,
			stm32->tc_fw_ver_of_bin.major_ver & 0xFF, stm32->tc_fw_ver_of_bin.minor_ver & 0xFF);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t get_tc_fw_ver_ic_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	mutex_lock(&stm32->dev_lock);

	if (stm32->hall_closed || !stm32->connect_state)
		goto NG;

	if (stm32->tc_crc == STM32_TC_CRC_OK)
		snprintf(buff, sizeof(buff), "%s-TC_v%02X%02X",
				stm32->model_name,
				stm32->tc_fw_ver_of_ic.major_ver & 0xFF, stm32->tc_fw_ver_of_ic.minor_ver & 0xFF);
	else
		snprintf(buff, sizeof(buff), "%s-TC_v0000",
				stm32->model_name);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	mutex_unlock(&stm32->dev_lock);

	return snprintf(buf, sizeof(buff), "%s", buff);

NG:
	snprintf(buff, sizeof(buff), "NG");

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	mutex_unlock(&stm32->dev_lock);

	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t get_tc_crc_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	char buff[256] = { 0 };

	if (stm32->hall_closed || !stm32->connect_state)
		return snprintf(buf, 3, "NG");

	snprintf(buff, sizeof(buff), "%04X", stm32->tc_crc);

	input_info(true, &stm32->client->dev, "%s: %s\n", __func__, buff);
	return snprintf(buf, sizeof(buff), "%s", buff);
}

static ssize_t block_pogo_keyboard_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);

	input_info(true, dev, "%s: %d\n", __func__, stm32->pogo_enable);

	return snprintf(buf, 5, "%d\n", stm32->pogo_enable);
}

static ssize_t block_pogo_keyboard_store(struct device *dev, struct device_attribute *attr,
		const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret, param;

	ret = kstrtoint(buf, 10, &param);
	if (ret)
		return ret;

