Linux4/samsung_kernel/kernel/kernel_device_modules-6.1/drivers/input/sec_input/stm32/stm32_pogo_cmd_v3.c
	stm32->pogo_enable = !!param;

	gpio_direction_output(stm32->dtdata->mcu_nrst, stm32->pogo_enable);
	stm32_delay(3);

	return size;
}

static int stm32_tc_fw_update(struct stm32_dev *stm32)
{
	int ret = 0;
	u8 buff[3] = { 0 };
	u16 page_size = 0;
	enum stm32_tc_fw_update_result result = TC_FW_RES_FAIL;

	ret = stm32_set_mode(stm32, MODE_DFU);
	if (ret < 0) {
		input_err(true, &stm32->client->dev, "%s: failed to set DFU mode\n", __func__);
		mutex_lock(&stm32->fw_lock);
		memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
		stm32->sec_pogo_keyboard_size = 0;
		mutex_unlock(&stm32->fw_lock);
		return ret;
	}

	stm32_enable_irq(stm32, INT_DISABLE_SYNC);

	stm32_delay(1000);

	ret = stm32_read_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_crc(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_reg_read(stm32->client, ID_TOUCHPAD, STM32_CMD_GET_PAGE_SIZE, 2, buff);
	if (ret < 0)
		goto out;

	memcpy(&page_size, &buff[0], 2);

	ret = stm32_i2c_reg_write(stm32->client, ID_TOUCHPAD, STM32_CMD_START_FW_UPGRADE);
	if (ret < 0)
		goto out;

	stm32_delay(800);

	ret = stm32_i2c_read_bulk(stm32->client, buff, 3);
	if (ret < 0)
		goto out;

	ret = stm32_i2c_read_bulk(stm32->client, buff, 1);
	if (ret < 0) {
		ret = -EIO;
		input_err(true, &stm32->client->dev, "%s: tc fw update cmd is failed\n", __func__);
		goto out;
	} else {
		result = (enum stm32_tc_fw_update_result)buff[0];
		if (result != TC_FW_RES_OK) {
			ret = -EIO;
			input_err(true, &stm32->client->dev, "%s: tc fw update cmd is failed, 0x%02X\n",
					__func__, buff[0]);
			goto out;
		}
	}

	input_info(true, &stm32->client->dev, "%s: start to update\n", __func__);

	mutex_lock(&stm32->i2c_lock);
	ret = stm32_write_fw(stm32, ID_TOUCHPAD, page_size);
	mutex_unlock(&stm32->i2c_lock);
	if (ret < 0)
		goto out;

	/* check fw version & crc of touch controller */
	ret = stm32_read_tc_version(stm32);
	if (ret < 0)
		goto out;

	ret = stm32_read_tc_crc(stm32);
	if (ret < 0)
		goto out;

	if (stm32->tc_crc != STM32_TC_CRC_OK) {
		ret = -EIO;
		input_err(true, &stm32->client->dev, "%s: CRC mismatch!\n", __func__);
		goto out;
	}

out:
	mutex_lock(&stm32->fw_lock);
	memset(stm32->sec_pogo_keyboard_fw, 0x0, stm32->sec_pogo_keyboard_size);
	stm32->sec_pogo_keyboard_size = 0;
	mutex_unlock(&stm32->fw_lock);

	if (stm32_i2c_reg_write(stm32->client, ID_MCU, STM32_CMD_ABORT) < 0)
		return -EIO;

	input_info(true, &stm32->client->dev, "%s: [APP MODE] Start with boot bank\n", __func__);

	if (stm32->connect_state)
		stm32_enable_irq(stm32, INT_ENABLE);

	return ret;
}

static ssize_t fw_update_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t size)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret = 0;
	enum stm32_fw_param param = FW_UPDATA_EXCEPTION;

	if (stm32->hall_closed || !stm32->connect_state)
		return -ENODEV;

	ret = kstrtoint(buf, 10, (int *)&param);
	if (ret)
		return ret;

	input_info(true, &stm32->client->dev, "%s\n", __func__);

	switch (param) {
	case FW_UPDATE_MCU:
		ret = stm32_load_fw_from_fota(stm32, ID_MCU);
		if (ret < 0)
			return ret;

		ret = stm32_fw_update(stm32);
		if (ret < 0)
			return ret;
		else
			return size;
	case FW_UPDATE_TC:
		ret = stm32_load_fw_from_fota(stm32, ID_TOUCHPAD);
		if (ret < 0)
			return ret;

		ret = stm32_tc_fw_update(stm32);
		if (ret < 0)
			return ret;
		else
			return size;
	default:
		return -EINVAL;
	}
}

static ssize_t fw_mcu_update_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret;

	ret = stm32_dev_firmware_update_menu(stm32, 1);

	if (!ret)
		return snprintf(buf, 3, "OK");
	else
		return snprintf(buf, 3, "NG");
}

static ssize_t get_mcu_fw_ver_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int ret = 0;

	if (stm32->connect_state)
		return snprintf(buf, 3, "NG");

	ret = stm32_dev_get_ic_ver(stm32);
	if (ret < 0)
		return snprintf(buf, 3, "NG");

	if (stm32->mdata.phone_ver[3] == stm32->mdata.ic_ver[3])
		return snprintf(buf, 3, "%2x", stm32->mdata.ic_ver[3]);
	else
		return snprintf(buf, 3, "NG");
}

#if IS_ENABLED(CONFIG_INPUT_SEC_NOTIFIER)
static ssize_t enabled_show(struct device *dev, struct device_attribute *attr, char *buf)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);

	input_info(true, &stm32->client->dev, "%s: %d\n", __func__, atomic_read(&stm32->enabled));

	return snprintf(buf, 2, "%d", atomic_read(&stm32->enabled));
}

static ssize_t enabled_store(struct device *dev, struct device_attribute *attr, const char *buf, size_t count)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	int buff[2];
	int ret;

	ret = sscanf(buf, "%d,%d", &buff[0], &buff[1]);
	if (ret != 2) {
		input_err(true, &stm32->client->dev, "%s: failed read params [%d]\n", __func__, ret);
		return -EINVAL;
	}

	input_info(true, &stm32->client->dev, "%s: %d %d\n", __func__, buff[0], buff[1]);

	if ((buff[0] == DISPLAY_STATE_ON || buff[0] == DISPLAY_STATE_DOZE || buff[0] == DISPLAY_STATE_DOZE_SUSPEND)
		&& stm32->connect_state) {
		stm32_enable_irq(stm32, INT_ENABLE);
		stm32_enable_conn_irq(stm32, INT_ENABLE);
		stm32_enable_conn_wake_irq(stm32, true);
	}

	return count;
}
#endif

static ssize_t sec_pogo_keyboard_fw_store(struct device *dev, struct device_attribute *attr, const char *buf,
						size_t count)
{
	struct stm32_dev *stm32 = dev_get_drvdata(dev);
	ssize_t ret;

	if (!stm32->sec_pogo_keyboard_fw)
		return 0;

	ret = -EINVAL;
	if (count > PAGE_SIZE) {
		input_err(true, &stm32->client->dev, "%s error count %ld %ld\n", __func__, count, PAGE_SIZE);
		return ret;
	}

	mutex_lock(&stm32->fw_lock);
	if (stm32->sec_pogo_keyboard_size + count > STM32_FW_SIZE) {
		input_err(true, &stm32->client->dev, "%s overflow error totalsize:%ld\n",
				__func__, stm32->sec_pogo_keyboard_size + count);
		mutex_unlock(&stm32->fw_lock);
		return ret;
	}

	memcpy(stm32->sec_pogo_keyboard_fw + stm32->sec_pogo_keyboard_size, buf, count);

	stm32->sec_pogo_keyboard_size += count;
	mutex_unlock(&stm32->fw_lock);

