Linux4/samsung_kernel/kernel/kernel_device_modules-6.1/drivers/input/sec_input/stm32/stm32_pogo_cmd_v3.c
	return count;
}

static DEVICE_ATTR_RW(keyboard_connected);
static DEVICE_ATTR_RO(hw_reset);
static DEVICE_ATTR_RO(get_fw_ver_bin);
static DEVICE_ATTR_RO(get_fw_ver_ic);
static DEVICE_ATTR_RO(get_crc);
static DEVICE_ATTR_RO(check_fw_update);
static DEVICE_ATTR_WO(fw_update);
static DEVICE_ATTR_RO(fw_mcu_update);
static DEVICE_ATTR_RW(debug_level);
#if !IS_ENABLED(CONFIG_SAMSUNG_PRODUCT_SHIP)
static DEVICE_ATTR_WO(write_cmd);
static DEVICE_ATTR_WO(read_cmd);
static DEVICE_ATTR_WO(set_booster_voltage);
#endif
static DEVICE_ATTR_RO(get_tc_fw_ver_bin);
static DEVICE_ATTR_RO(get_tc_fw_ver_ic);
static DEVICE_ATTR_RO(get_tc_crc);
static DEVICE_ATTR_RW(block_pogo_keyboard);
static DEVICE_ATTR_RO(get_mcu_fw_ver);
#if IS_ENABLED(CONFIG_INPUT_SEC_NOTIFIER)
static DEVICE_ATTR_RW(enabled);
#endif
static DEVICE_ATTR_WO(sec_pogo_keyboard_fw);

static struct attribute *key_attributes[] = {
	&dev_attr_keyboard_connected.attr,
	&dev_attr_hw_reset.attr,
	&dev_attr_get_fw_ver_bin.attr,
	&dev_attr_get_fw_ver_ic.attr,
	&dev_attr_get_crc.attr,
	&dev_attr_check_fw_update.attr,
	&dev_attr_fw_update.attr,
	&dev_attr_fw_mcu_update.attr,
	&dev_attr_debug_level.attr,
#if !IS_ENABLED(CONFIG_SAMSUNG_PRODUCT_SHIP)
	&dev_attr_write_cmd.attr,
	&dev_attr_read_cmd.attr,
	&dev_attr_set_booster_voltage.attr,
#endif
	&dev_attr_get_tc_fw_ver_bin.attr,
	&dev_attr_get_tc_fw_ver_ic.attr,
	&dev_attr_get_tc_crc.attr,
	&dev_attr_block_pogo_keyboard.attr,
	&dev_attr_get_mcu_fw_ver.attr,
#if IS_ENABLED(CONFIG_INPUT_SEC_NOTIFIER)
	&dev_attr_enabled.attr,
#endif
	&dev_attr_sec_pogo_keyboard_fw.attr,
	NULL,
};

static struct attribute_group key_attr_group = {
	.attrs = key_attributes,
};

int stm32_init_cmd(struct stm32_dev *stm32)
{
	int ret = 0;

	stm32->sec_pogo = sec_device_create(stm32, "sec_keypad");
	if (IS_ERR(stm32->sec_pogo)) {
		input_err(true, &stm32->client->dev, "Failed to create sec_keypad device\n");
		return SEC_ERROR;
	}

	ret = sysfs_create_group(&stm32->sec_pogo->kobj, &key_attr_group);
	if (ret) {
		input_err(true, &stm32->client->dev, "Failed to create sysfs: %d\n", ret);
		stm32_destroy_fn(stm32);
		return SEC_ERROR;
	}

	return SEC_SUCCESS;
}

void stm32_destroy_fn(struct stm32_dev *stm32)
{
	sec_device_destroy(stm32->sec_pogo->devt);
}

MODULE_LICENSE("GPL");
